app/controllers/books_controller.rb

INSERT INTO "books" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "a"], ["body", "a"], ["created_at", "2023-05-03 05:49:59.666692"], ["updated_at", "2023-05-03 05:49:59.666692"]]
SELECT "books".* FROM "books"
---
  def create
    @book = Book.new(book_params)
      if @book.save
        flash[:notice]="Book was successfully created."
        redirect_to book_path(@book)
      else
        @books=Book.all

UPDATE "books" SET "title" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "b"], ["updated_at", "2023-05-03 07:03:59.698110"], ["id", 6]]
---
  def update
    if @book.update(book_params)